Update flow_diagram.md
